/**********************************************************************************************************
 * @文件     remote.c
 * @说明     遥控器通道数据处理
 * @版本  	 V1.0
 * @作者     Leomoon
 * @日期     2020.10
**********************************************************************************************************/
#include "remote.h"  
#include "drv_sbus.h"
#include "mathTool.h"

#include "flightStatus.h"

static u16 cwd_cnt[8];
u8 chn_en_bit = 0;
s16 CH_N[CH_NUM] = {0,0,0,0};

/**********************************************************************************************************
*函 数 名: Remote_Control_Init
*功能说明: 遥控初始化，调用相应通信协议
*形    参: void
*返 回 值: void
**********************************************************************************************************/
void Remote_Control_Init(void)
{
	//使用Sbus通信协议
	Sbus_Init();
}

/**********************************************************************************************************
*函 数 名: ch_watch_dog
*功能说明: 检测看门狗信号是否达到阈值
*形    参: 时间（dT_ms）
*返 回 值: void
**********************************************************************************************************/
static void ch_watch_dog(u8 dT_ms)
{
	for(u8 i=0; i<8; i++)
	{
		if(cwd_cnt[i] < 500)
		{
			cwd_cnt[i] += dT_ms;
			chn_en_bit |= 0x01<<i;
		}
		else
		{
			chn_en_bit &= ~(0x01<<i);
		}
	}
}

/**********************************************************************************************************
*函 数 名: RC_Duty_Task
*功能说明: 遥控信号处理主任务
*形    参: 时间周期（dT_ms）
*返 回 值: void
**********************************************************************************************************/
void RC_Duty_Task(u8 dT_ms)
{
	//Sbus信号解析
	for(u8 i=0; i<CH_NUM; i++)
	{
		if(chn_en_bit & (1<<i))	//该通道有值
		{
			//CH_N[]+1500为上位机显示通道值
			CH_N[i] = 0.65f*((s16)Rc_Sbus_In[i]-1024);	//248 --1024 --1800，处理成大约+-500摇杆量
			if(i==CH5)
			{
				if(CH_N[i]<-300)
					SetFlightMode(MANUAL);
				else if(CH_N[i]>-100 && CH_N[i]<100)
					SetFlightMode(MISSION);
				else if(CH_N[i]>300)
					SetFlightMode(MISSION);
			}
			if(i==CH6 && CH_N[i]>100)
			{
				SetFlightMode(FAILSAFE);
			}
		
		}
		else
		{
			CH_N[i] = 0;
			SetFlightMode(FAILSAFE);
		}
		CH_N[i] = LIMIT(CH_N[i], -500, 500);	//限制到+-500
	}
	
	///////////////////////////////////////////////////
	//通道看门狗
	ch_watch_dog(dT_ms);
	
	//TODO:解锁检测， 摇杆触发功能检测， 失控保护检查
}


/**********************************************************************************************************
*函 数 名: ch_watch_dog_feed
*功能说明: 遥控信号看门狗 喂狗操作（累计归零）
*形    参: void
*返 回 值: void
**********************************************************************************************************/
void ch_watch_dog_feed(u8 ch_n)
{
	ch_n = LIMIT(ch_n, 0, 7);
	cwd_cnt[ch_n] = 0;
}

