/**********************************************************************************************************
 * @文件     board.c
 * @说明     硬件初始化(引脚，时钟，中断)
 * @版本  	 V1.0
 * @作者     Leomoon
 * @日期     2020.8
**********************************************************************************************************/
#include "board.h"
#include "stm32f4xx.h"

#include "delay.h"
#include "drv_spi.h"
#include "drv_usart.h"
#include "drv_sbus.h"
#include "drv_pwm.h"
#include "rgb.h"


/**********************************************************************************************************
*函 数 名: BoardInit
*功能说明: 飞控硬件初始化
*形    参: 无
*返 回 值: 无
**********************************************************************************************************/
void BoardInit(void)
{
	//中断优先级组别设置，四位优先级全是抢占优先级(pre-emption priority)，没有亚优先级(subpriority)
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);
	
	//系统时钟初始化
	DelayInit(168);
	
	//RGB初始化
	RGB_Init();
	
	//SPI1,2初始化
	Spi1_Init();
	Spi2_Init();
	
	//串口初始化(usart2,3)
	Usart2_Init(500000);
	Usart3_Init(57600);
	
}

