/**********************************************************************************************************
 * @文件     module.c
 * @说明     提供通用的传感器数据接口(初始化和数据更新),除了对数据实时性要求较高的IMU之外（即读即用），
 *          其它传感器的数据更新与使用并不完全同步
 * @版本  	 V1.0
 * @作者     Leomoon
 * @日期     2020.09
**********************************************************************************************************/
#include "module.h"
#include "boardConfig.h"

#include "icm20602.h"
#include "ak8975.h"
#include "spl0601.h"

/**********************************************************************************************************
*函 数 名: AccSensorRotate
*功能说明: 加速度数据方向变换，以适应传感器的实际安装方向
*形    参: 加速度数据指针
*返 回 值: 无
**********************************************************************************************************/
static void AccSensorRotate(Vector3f_t *acc)
{
    RotateVector3f(ACC_ROTATION, acc);
}

/**********************************************************************************************************
*函 数 名: GyroSensorRotate
*功能说明: 陀螺仪传感器方向变换，以适应传感器的实际安装方向
*形    参: 陀螺仪数据指针
*返 回 值: 无
**********************************************************************************************************/
static void GyroSensorRotate(Vector3f_t* gyro)
{
    RotateVector3f(GYRO_ROTATION, gyro);
}

/**********************************************************************************************************
*函 数 名: MagSensorRotate
*功能说明: 磁力计数据方向变换，以适应传感器的实际安装方向
*形    参: 磁力计数据指针
*返 回 值: 无
**********************************************************************************************************/
static void MagSensorRotate(Vector3f_t *mag)
{
    RotateVector3f(MAG_ROTATION, mag);
}

/**********************************************************************************************************
*函 数 名: IMUSensorInit
*功能说明: 惯性传感器初始化
*形    参: 无
*返 回 值: IMU存在状态
**********************************************************************************************************/
void IMUSensorInit(void)
{
	if(IMU_TYPE == ICM20602)
	{
		ICM20602CSPin_Init();
		ICM20602_Init();
	}
	
}

/**********************************************************************************************************
*函 数 名: GyroDataUpdate
*功能说明: 角速度数据更新
*形    参: 读出数据指针
*返 回 值: 无
**********************************************************************************************************/
void GyroDataUpdate(Vector3f_t* gyro)
{
    if(IMU_TYPE == ICM20602)
        ICM20602_UpdateGyro(gyro);

	//传感器方向转换
	GyroSensorRotate(gyro);
}

/**********************************************************************************************************
*函 数 名: AccSensorUpdate
*功能说明: 加速度数据更新
*形    参: 读出数据指针
*返 回 值: 无
**********************************************************************************************************/
void AccDataUpdate(Vector3f_t* acc)
{
    if(IMU_TYPE == ICM20602)
        ICM20602_UpdateAcc(acc);

    //传感器方向转换
	AccSensorRotate(acc);
}

/**********************************************************************************************************
*函 数 名: TempSensorUpdate
*功能说明: 陀螺仪温度数据更新
*形    参: 读出数据指针
*返 回 值: 无
**********************************************************************************************************/
void IMUTempUpdate(float* temp)
{
    if(IMU_TYPE == ICM20602)
        ICM20602_UpdateTemp(temp);
}

/**********************************************************************************************************
*函 数 名: MagSensorInit
*功能说明: 磁力传感器初始化
*形    参: 无
*返 回 值: 磁力计存在状态
**********************************************************************************************************/
void MagSensorInit(void)
{
	if(MAG_TYPE == AK8975)
	{
		AK8975CSPin_Init();
	}

}

/**********************************************************************************************************
*函 数 名: MagDataUpdate
*功能说明: 磁罗盘数据更新
*形    参: 无
*返 回 值: 无
**********************************************************************************************************/
void MagDataUpdate(void)
{
	if(MAG_TYPE == AK8975)
		AK8975_Update();
}

/**********************************************************************************************************
*函 数 名: MagDataRead
*功能说明: 罗盘数据读取
*形    参: 读出数据指针
*返 回 值: 无
**********************************************************************************************************/
//Vector3f_t mag_raw1;
void MagDataRead(Vector3f_t* mag)
{
	if(MAG_TYPE == AK8975)
		AK8975_ReadMag(mag);
	
	//传感器方向转换
	MagSensorRotate(mag);
}

/**********************************************************************************************************
*函 数 名: BaroSensorInit
*功能说明: 气压传感器初始化
*形    参: 无
*返 回 值: 气压计存在状态
**********************************************************************************************************/
void BaroSensorInit(void)
{
	if(BARO_TYPE == SPL0601)
	{
		SPL0601CSPin_Init();
		SPL0601_Init();
	}
}

/**********************************************************************************************************
*函 数 名: BaroDataUpdate
*功能说明: 气压高度数据更新
*形    参: 无
*返 回 值: 无
**********************************************************************************************************/
void BaroDataUpdate(void)
{
	if(BARO_TYPE == SPL0601)
		SPL0601_Update();
}

/**********************************************************************************************************
*函 数 名: BaroPresRead
*功能说明: 气压高度数据读取
*形    参: 读出数据指针
*返 回 值: 无
**********************************************************************************************************/
void BaroPresRead(float* pres)
{
	if(BARO_TYPE == SPL0601)
	{
		SPL0601_ReadPres(pres);	
	}
}

/**********************************************************************************************************
*函 数 名: BaroTempRead
*功能说明: 气压计温度读取
*形    参: 读出数据指针
*返 回 值: 无
**********************************************************************************************************/
void BaroTempRead(float* temp)
{
	if(BARO_TYPE == SPL0601)
	{
		SPL0601_ReadTemp(temp);
	}
}

/**********************************************************************************************************
*函 数 名: TempControlSet
*功能说明: 陀螺仪传感器加热数值设置（0-1000）
*形    参: 读出数据指针
*返 回 值: 无
**********************************************************************************************************/
void TempControlSet(int16_t value)
{
	
#if(configUSE_SENSORHEAT == 1)
    TempControlPWMSet(value);
#else
    //TODO:TempControlPWMSet(0);
#endif
}


